![Alt text]()

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> Pandas is an open-source data manipulation and analysis library for the Python programming language. It provides data structures and functions for working with structured data, such as tabular data, time series, and more. Pandas is a popular choice for data scientists, analysts, and researchers when it comes to data cleaning, transformation, and analysis.</div>

In [1]:
import pandas as pd
import numpy as np

# <span style='color:#150458 '> Use Cases : </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> 
    
1. Reading CSV/excel/JSON file
    
2. EDA
    
3. Data Cleaning
    
4. Encoding(OneHot Encoder)
    
5. Join Tables (left , right, inner, outer)
    
6. Feature Selection
</div>

# <span style='color:#150458 '> Data Structures : </span>

## 1 <span style='color:#E70488 '> | </span> Series

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> A one-dimensional labeled array capable of holding any data type (integers, strings, floating-point numbers, Python objects, etc.). It is similar to a one-dimensional NumPy array, but it has an index, which makes it more flexible. </div>

In [2]:
series = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
series2 = pd.Series(['a','b','c','d','e'])
series2

0    a
1    b
2    c
3    d
4    e
dtype: object

## 2 <span style='color:#E70488 '> | </span> DataFrame

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

* A two-dimensional labeled data structure with columns of potentially different data types. It is similar to a spreadsheet or SQL table, where each column can have a different type.

    
* Two Data Structures:
    1. DataFrame (2-D >> rows and column)
    2. Series(1-D array) >> Single column of dataframe</div>

In [4]:
data = {'Name':['Alka','Madhu','Kiara'],
       'Age':[34,54,23],
       'City':['NY','Mumbai','Delhi']}

df = pd.DataFrame(data)
df

    Name  Age    City
0   Alka   34      NY
1  Madhu   54  Mumbai
2  Kiara   23   Delhi

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> In addition to these main data structures, Pandas also provides other specialized data structures like Index, TimeSeries, and Categorical. Here's a brief overview: </div>

###  <span style='color:#E70488 '> [ </span> Index<span style='color:#E70488 '> ] </span>

In [5]:
index = pd.Index(['a','b','c','d'])
index

Index(['a', 'b', 'c', 'd'], dtype='object')

###  <span style='color:#E70488 '> [ </span> TimeSeries <span style='color:#E70488 '> ] </span>

In [6]:
dates = pd.date_range('2020-01-01', periods=5)
ts = pd.Series([1,2,3,4,5],index=dates)
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[ns]', freq='D')

###  <span style='color:#E70488 '> [ </span> Categorical <span style='color:#E70488 '> ] </span>

In [7]:
cat = pd.Categorical(['a','b','c'])
cat

['a', 'b', 'c']
Categories (3, object): ['a', 'b', 'c']

# <span style='color:#150458 '> Functions : </span>

###  <span style='color:#E70488 '> [ </span> Read DataFrame <span style='color:#E70488 '> ] </span>

In [8]:
df_heart = pd.read_csv('heart.csv')
df_heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [9]:
df_emp = pd.read_excel('Emp_Records.xlsx')
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [10]:
df2 = pd.read_excel('Emp_Records.xlsx', sheet_name = 'emp_salary')
df2

    Salary          City
0   168251        Denver
1    51063     Stonewall
2    50155  Michigantown
3   180294      Hydetown
4   117642       Fremont
..     ...           ...
95  129774        Biloxi
96  156194  Carol Stream
97   95673       Detroit
98   51015      Mc Grath
99   93650          Alma

[100 rows x 2 columns]

###  <span style='color:#E70488 '> [ </span> Shape of Dataframe <span style='color:#E70488 '> ] </span>

In [11]:
df_emp.shape

(100, 7)

In [12]:
print("Number of rows :", df_emp.shape[0])
print("Number of columns :", df_emp.shape[1])

Number of rows : 100
Number of columns : 7

###  <span style='color:#E70488 '> [ </span> Columns <span style='color:#E70488 '> ] </span>

In [13]:
df_emp.columns

Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
       'Salary', 'City'],
      dtype='object')

###  <span style='color:#E70488 '> [ </span> Index <span style='color:#E70488 '> ] </span>

In [14]:
df_emp.index

RangeIndex(start=0, stop=100, step=1)

###  <span style='color:#E70488 '> [ </span> Axes <span style='color:#E70488 '> ] </span>

In [15]:
df_emp.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
        'Salary', 'City'],
       dtype='object')]

###  <span style='color:#E70488 '> [ </span> dtypes <span style='color:#E70488 '> ] </span>

In [16]:
df_emp.dtypes

Emp ID              int64
First Name         object
Age in Yrs        float64
Weight in Kgs       int64
Age in Company    float64
Salary              int64
City               object
dtype: object

###  <span style='color:#E70488 '> [ </span> info <span style='color:#E70488 '> ] </span>

In [17]:
df_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      100 non-null    object
 2   Age in Yrs      100 non-null    float64
 3   Weight in Kgs   100 non-null    int64
 4   Age in Company  100 non-null    float64
 5   Salary          100 non-null    int64
 6   City            100 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 5.6+ KB

###  <span style='color:#E70488 '> [ </span> describe <span style='color:#E70488 '> ] </span>

In [18]:
df_emp.describe()

             Emp ID  Age in Yrs  Weight in Kgs  Age in Company         Salary
count     100.00000  100.000000     100.000000      100.000000     100.000000
mean   547652.10000   39.238700      58.080000        8.978400  119738.090000
std    257664.16679   12.066252      12.294106        8.657358   46185.278194
min    134841.00000   21.100000      40.000000        0.020000   42005.000000
25%    328643.75000   28.177500      50.000000        2.152500   83979.750000
50%    497414.00000   37.595000      56.000000        6.435000  118049.500000
75%    766040.00000   49.900000      61.250000       13.762500  162509.250000
max    979607.00000   59.470000      90.000000       34.520000  197537.000000

# <span style='color:#150458 '> Access Data from Dataframe : </span>

###  <span style='color:#E70488 '> [ </span> Access columns <span style='color:#E70488 '> ] </span>

In [20]:
df_emp['Salary']

0     168251
1      51063
2      50155
3     180294
4     117642
       ...
95    129774
96    156194
97     95673
98     51015
99     93650
Name: Salary, Length: 100, dtype: int64

In [21]:
df_emp[['Emp ID', 'First Name', 'Age in Yrs']]

    Emp ID First Name  Age in Yrs
0   677509       Lois       36.36
1   940761     Brenda       47.02
2   428945        Joe       54.15
3   408351      Diane       39.67
4   193819   Benjamin       40.31
..     ...        ...         ...
95  639892       Jose       22.82
96  704709     Harold       32.61
97  461593     Nicole       52.66
98  392491    Theresa       29.60
99  495141      Tammy       38.38

[100 rows x 3 columns]

###  <span style='color:#E70488 '> [ </span> Access rows <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> First N rows : </span>

In [22]:
df_emp.head() #5rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

In [23]:
df_emp.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester
8,477616,Frances,58.18,42,23.27,121587,Delmita
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs

####  <span style='color:#E70488 '> Last N rows : </span>

In [24]:
df_emp.tail() #5rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [25]:
df_emp.tail(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
90,185032,Eugene,37.84,59,2.64,122950,Racine
91,867084,Deborah,39.77,54,15.41,52767,Atqasuk
92,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
93,158666,Rebecca,56.00,55,34.32,160043,Independence
94,489424,Phillip,39.43,82,1.56,181774,Mapleton
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

###  <span style='color:#E70488 '> [ </span> Access rows & Columns <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.Slicing Method : </span>

In [26]:
df_emp[4:8]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester

####  <span style='color:#E70488 '> 2.iloc Method : </span>

In [27]:
df_emp.iloc[:,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [28]:
df_emp.iloc[3:9,1:3]

  First Name  Age in Yrs
3      Diane       39.67
4   Benjamin       40.31
5    Patrick       34.86
6      Nancy       22.14
7      Carol       59.12
8    Frances       58.18

In [29]:
df_emp.iloc[[1,4],[3,6]]

   Weight in Kgs       City
1             60  Stonewall
4             58    Fremont

####  <span style='color:#E70488 '> 3.loc : </span>

In [30]:
df_emp.loc[:,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [31]:
df_emp.loc[2:5,'City']

2    Michigantown
3        Hydetown
4         Fremont
5       Macksburg
Name: City, dtype: object

In [32]:
df_emp.loc[2:5,'Weight in Kgs':'Salary']

   Weight in Kgs  Age in Company  Salary
2             68            0.98   50155
3             51           18.30  180294
4             58            4.01  117642
5             58           12.02   72305

In [33]:
df_emp.loc[[4,7,99],['Weight in Kgs','Salary','City']]

    Weight in Kgs  Salary         City
4              58  117642      Fremont
7              40   60918  Blanchester
99             55   93650         Alma

In [34]:
df_tes = pd.DataFrame(np.random.randint(20,30,size=(7,4)), index=list('abcdefg'),columns=list('KWSD'))
df_tes

    K   W   S   D
a  22  22  27  28
b  21  22  25  27
c  22  26  24  22
d  26  25  20  25
e  28  21  26  23
f  25  29  28  27
g  29  23  27  26

In [35]:
df_tes.loc['c':'f','W':'D']

    W   S   D
c  26  24  22
d  25  20  25
e  21  26  23
f  29  28  27

# <span style='color:#150458 '> Sort Dataframe : </span>

## 1 <span style='color:#E70488 '> | </span> Sort Index